## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 10 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| add    | `aws_cloudwatch_query_definition.admin-svc-audit-removed-users[0]` |
| update | `aws_iam_openid_connect_provider.notification-canada-ca`           |
|        | `aws_iam_role.admin`                                               |
|        | `aws_iam_role.api`                                                 |
|        | `aws_iam_role.celery`                                              |
|        | `aws_iam_role.database`                                            |
|        | `aws_iam_role.document_download`                                   |
|        | `aws_iam_role.notification-service-account-role`                   |
|        | `aws_iam_role.secrets_csi_blazer`                                  |
|        | `aws_iam_role.secrets_csi_nginx`                                   |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/18320739138).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:31:33.406 STDOUT terraform:   + create
17:31:33.406 STDOUT terraform:   ~ update in-place
17:31:33.406 STDOUT terraform:  <= read (data resources)
17:31:33.406 STDOUT terraform: Terraform will perform the following actions:
17:31:33.406 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_admin will be read during apply
17:31:33.406 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.406 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_admin" {
17:31:33.406 STDOUT terraform:       + id            = (known after apply)
17:31:33.406 STDOUT terraform:       + json          = (known after apply)
17:31:33.406 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.406 STDOUT terraform:       + statement {
17:31:33.406 STDOUT terraform:           + actions = [
17:31:33.406 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.406 STDOUT terraform:             ]
17:31:33.406 STDOUT terraform:           + effect  = "Allow"
17:31:33.406 STDOUT terraform:           + condition {
17:31:33.406 STDOUT terraform:               + test     = "StringEquals"
17:31:33.406 STDOUT terraform:               + values   = [
17:31:33.406 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.406 STDOUT terraform:                 ]
17:31:33.406 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.406 STDOUT terraform:             }
17:31:33.406 STDOUT terraform:           + condition {
17:31:33.406 STDOUT terraform:               + test     = "StringEquals"
17:31:33.406 STDOUT terraform:               + values   = [
17:31:33.406 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-admin",
17:31:33.406 STDOUT terraform:                 ]
17:31:33.406 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.406 STDOUT terraform:             }
17:31:33.406 STDOUT terraform:           + principals {
17:31:33.406 STDOUT terraform:               + identifiers = [
17:31:33.406 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.407 STDOUT terraform:                 ]
17:31:33.407 STDOUT terraform:               + type        = "Federated"
17:31:33.407 STDOUT terraform:             }
17:31:33.407 STDOUT terraform:         }
17:31:33.407 STDOUT terraform:     }
17:31:33.407 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_api will be read during apply
17:31:33.407 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.407 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_api" {
17:31:33.407 STDOUT terraform:       + id            = (known after apply)
17:31:33.407 STDOUT terraform:       + json          = (known after apply)
17:31:33.407 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.407 STDOUT terraform:       + statement {
17:31:33.407 STDOUT terraform:           + actions = [
17:31:33.407 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.407 STDOUT terraform:             ]
17:31:33.407 STDOUT terraform:           + effect  = "Allow"
17:31:33.407 STDOUT terraform:           + condition {
17:31:33.407 STDOUT terraform:               + test     = "StringEquals"
17:31:33.407 STDOUT terraform:               + values   = [
17:31:33.407 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.407 STDOUT terraform:                 ]
17:31:33.407 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.407 STDOUT terraform:             }
17:31:33.407 STDOUT terraform:           + condition {
17:31:33.407 STDOUT terraform:               + test     = "StringEquals"
17:31:33.407 STDOUT terraform:               + values   = [
17:31:33.407 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-api",
17:31:33.407 STDOUT terraform:                 ]
17:31:33.407 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.408 STDOUT terraform:             }
17:31:33.408 STDOUT terraform:           + principals {
17:31:33.408 STDOUT terraform:               + identifiers = [
17:31:33.408 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.408 STDOUT terraform:                 ]
17:31:33.408 STDOUT terraform:               + type        = "Federated"
17:31:33.408 STDOUT terraform:             }
17:31:33.408 STDOUT terraform:         }
17:31:33.408 STDOUT terraform:     }
17:31:33.408 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_celery will be read during apply
17:31:33.410 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.410 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_celery" {
17:31:33.410 STDOUT terraform:       + id            = (known after apply)
17:31:33.410 STDOUT terraform:       + json          = (known after apply)
17:31:33.410 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.410 STDOUT terraform:       + statement {
17:31:33.411 STDOUT terraform:           + actions = [
17:31:33.411 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.411 STDOUT terraform:             ]
17:31:33.411 STDOUT terraform:           + effect  = "Allow"
17:31:33.411 STDOUT terraform:           + condition {
17:31:33.411 STDOUT terraform:               + test     = "StringEquals"
17:31:33.411 STDOUT terraform:               + values   = [
17:31:33.411 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.411 STDOUT terraform:                 ]
17:31:33.411 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.411 STDOUT terraform:             }
17:31:33.411 STDOUT terraform:           + condition {
17:31:33.411 STDOUT terraform:               + test     = "StringEquals"
17:31:33.411 STDOUT terraform:               + values   = [
17:31:33.411 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-celery",
17:31:33.411 STDOUT terraform:                 ]
17:31:33.411 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.411 STDOUT terraform:             }
17:31:33.411 STDOUT terraform:           + principals {
17:31:33.411 STDOUT terraform:               + identifiers = [
17:31:33.411 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.411 STDOUT terraform:                 ]
17:31:33.411 STDOUT terraform:               + type        = "Federated"
17:31:33.411 STDOUT terraform:             }
17:31:33.411 STDOUT terraform:         }
17:31:33.411 STDOUT terraform:     }
17:31:33.411 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_database will be read during apply
17:31:33.411 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.411 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_database" {
17:31:33.411 STDOUT terraform:       + id            = (known after apply)
17:31:33.411 STDOUT terraform:       + json          = (known after apply)
17:31:33.411 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.412 STDOUT terraform:       + statement {
17:31:33.412 STDOUT terraform:           + actions = [
17:31:33.412 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.412 STDOUT terraform:             ]
17:31:33.412 STDOUT terraform:           + effect  = "Allow"
17:31:33.412 STDOUT terraform:           + condition {
17:31:33.412 STDOUT terraform:               + test     = "StringEquals"
17:31:33.412 STDOUT terraform:               + values   = [
17:31:33.412 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.412 STDOUT terraform:                 ]
17:31:33.412 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.412 STDOUT terraform:             }
17:31:33.412 STDOUT terraform:           + condition {
17:31:33.412 STDOUT terraform:               + test     = "StringEquals"
17:31:33.412 STDOUT terraform:               + values   = [
17:31:33.412 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-database",
17:31:33.412 STDOUT terraform:                 ]
17:31:33.412 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.412 STDOUT terraform:             }
17:31:33.412 STDOUT terraform:           + principals {
17:31:33.412 STDOUT terraform:               + identifiers = [
17:31:33.412 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.412 STDOUT terraform:                 ]
17:31:33.412 STDOUT terraform:               + type        = "Federated"
17:31:33.412 STDOUT terraform:             }
17:31:33.412 STDOUT terraform:         }
17:31:33.412 STDOUT terraform:     }
17:31:33.412 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_document_download will be read during apply
17:31:33.412 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.412 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_document_download" {
17:31:33.412 STDOUT terraform:       + id            = (known after apply)
17:31:33.413 STDOUT terraform:       + json          = (known after apply)
17:31:33.413 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.413 STDOUT terraform:       + statement {
17:31:33.413 STDOUT terraform:           + actions = [
17:31:33.413 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.413 STDOUT terraform:             ]
17:31:33.413 STDOUT terraform:           + effect  = "Allow"
17:31:33.413 STDOUT terraform:           + condition {
17:31:33.413 STDOUT terraform:               + test     = "StringEquals"
17:31:33.413 STDOUT terraform:               + values   = [
17:31:33.413 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.413 STDOUT terraform:                 ]
17:31:33.413 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.413 STDOUT terraform:             }
17:31:33.413 STDOUT terraform:           + condition {
17:31:33.413 STDOUT terraform:               + test     = "StringEquals"
17:31:33.413 STDOUT terraform:               + values   = [
17:31:33.413 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-document-download",
17:31:33.413 STDOUT terraform:                 ]
17:31:33.413 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.413 STDOUT terraform:             }
17:31:33.413 STDOUT terraform:           + principals {
17:31:33.413 STDOUT terraform:               + identifiers = [
17:31:33.413 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.413 STDOUT terraform:                 ]
17:31:33.416 STDOUT terraform:               + type        = "Federated"
17:31:33.416 STDOUT terraform:             }
17:31:33.416 STDOUT terraform:         }
17:31:33.416 STDOUT terraform:     }
17:31:33.416 STDOUT terraform:   # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
17:31:33.416 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.417 STDOUT terraform:  <= data "aws_iam_policy_document" "eks-assume-role-policy" {
17:31:33.417 STDOUT terraform:       + id            = (known after apply)
17:31:33.417 STDOUT terraform:       + json          = (known after apply)
17:31:33.417 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.417 STDOUT terraform:       + statement {
17:31:33.417 STDOUT terraform:           + actions = [
17:31:33.417 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.417 STDOUT terraform:             ]
17:31:33.417 STDOUT terraform:           + effect  = "Allow"
17:31:33.417 STDOUT terraform:           + condition {
17:31:33.417 STDOUT terraform:               + test     = "StringEquals"
17:31:33.417 STDOUT terraform:               + values   = [
17:31:33.417 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notification-service-account",
17:31:33.417 STDOUT terraform:                 ]
17:31:33.417 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.417 STDOUT terraform:             }
17:31:33.417 STDOUT terraform:           + principals {
17:31:33.417 STDOUT terraform:               + identifiers = [
17:31:33.417 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.417 STDOUT terraform:                 ]
17:31:33.417 STDOUT terraform:               + type        = "Federated"
17:31:33.417 STDOUT terraform:             }
17:31:33.417 STDOUT terraform:         }
17:31:33.417 STDOUT terraform:     }
17:31:33.417 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
17:31:33.417 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.417 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
17:31:33.417 STDOUT terraform:       + id            = (known after apply)
17:31:33.417 STDOUT terraform:       + json          = (known after apply)
17:31:33.417 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.417 STDOUT terraform:       + statement {
17:31:33.417 STDOUT terraform:           + actions = [
17:31:33.417 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.418 STDOUT terraform:             ]
17:31:33.418 STDOUT terraform:           + effect  = "Allow"
17:31:33.418 STDOUT terraform:           + condition {
17:31:33.418 STDOUT terraform:               + test     = "StringEquals"
17:31:33.418 STDOUT terraform:               + values   = [
17:31:33.418 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.418 STDOUT terraform:                 ]
17:31:33.418 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.418 STDOUT terraform:             }
17:31:33.418 STDOUT terraform:           + condition {
17:31:33.418 STDOUT terraform:               + test     = "StringEquals"
17:31:33.418 STDOUT terraform:               + values   = [
17:31:33.418 STDOUT terraform:                   + "system:serviceaccount:tools:blazer",
17:31:33.418 STDOUT terraform:                 ]
17:31:33.418 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.418 STDOUT terraform:             }
17:31:33.418 STDOUT terraform:           + principals {
17:31:33.418 STDOUT terraform:               + identifiers = [
17:31:33.418 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.418 STDOUT terraform:                 ]
17:31:33.418 STDOUT terraform:               + type        = "Federated"
17:31:33.418 STDOUT terraform:             }
17:31:33.418 STDOUT terraform:         }
17:31:33.418 STDOUT terraform:     }
17:31:33.418 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
17:31:33.418 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:31:33.418 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
17:31:33.418 STDOUT terraform:       + id            = (known after apply)
17:31:33.418 STDOUT terraform:       + json          = (known after apply)
17:31:33.418 STDOUT terraform:       + minified_json = (known after apply)
17:31:33.418 STDOUT terraform:       + statement {
17:31:33.418 STDOUT terraform:           + actions = [
17:31:33.419 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
17:31:33.419 STDOUT terraform:             ]
17:31:33.419 STDOUT terraform:           + effect  = "Allow"
17:31:33.419 STDOUT terraform:           + condition {
17:31:33.419 STDOUT terraform:               + test     = "StringEquals"
17:31:33.419 STDOUT terraform:               + values   = [
17:31:33.419 STDOUT terraform:                   + "sts.amazonaws.com",
17:31:33.419 STDOUT terraform:                 ]
17:31:33.419 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
17:31:33.419 STDOUT terraform:             }
17:31:33.419 STDOUT terraform:           + condition {
17:31:33.419 STDOUT terraform:               + test     = "StringEquals"
17:31:33.419 STDOUT terraform:               + values   = [
17:31:33.419 STDOUT terraform:                   + "system:serviceaccount:nginx:ingress-nginx-ingress",
17:31:33.419 STDOUT terraform:                 ]
17:31:33.419 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
17:31:33.419 STDOUT terraform:             }
17:31:33.419 STDOUT terraform:           + principals {
17:31:33.419 STDOUT terraform:               + identifiers = [
17:31:33.419 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
17:31:33.419 STDOUT terraform:                 ]
17:31:33.419 STDOUT terraform:               + type        = "Federated"
17:31:33.419 STDOUT terraform:             }
17:31:33.419 STDOUT terraform:         }
17:31:33.419 STDOUT terraform:     }
17:31:33.419 STDOUT terraform:   # aws_cloudwatch_query_definition.admin-svc-audit-removed-users[0] will be created
17:31:33.422 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "admin-svc-audit-removed-users" {
17:31:33.422 STDOUT terraform:       + id                  = (known after apply)
17:31:33.422 STDOUT terraform:       + log_group_names     = [
17:31:33.422 STDOUT terraform:           + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
17:31:33.423 STDOUT terraform:         ]
17:31:33.423 STDOUT terraform:       + name                = "Admin / Service audit - removed users"
17:31:33.423 STDOUT terraform:       + query_definition_id = (known after apply)
17:31:33.423 STDOUT terraform:       + query_string        = <<-EOT
17:31:33.423 STDOUT terraform:             fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
17:31:33.423 STDOUT terraform:             | filter kubernetes.container_name like /notify-admin/
17:31:33.423 STDOUT terraform:             | filter @message like /is removing user/
17:31:33.423 STDOUT terraform:             | parse @message "User * is removing user: * from service: *" as @admin_user, @removed_user, @service
17:31:33.423 STDOUT terraform:             | sort @timestamp desc
17:31:33.423 STDOUT terraform:             | display @timestamp, @admin_user, @removed_user, @service, log
17:31:33.423 STDOUT terraform:             | limit 20
17:31:33.423 STDOUT terraform:         EOT
17:31:33.423 STDOUT terraform:       + region              = "ca-central-1"
17:31:33.423 STDOUT terraform:     }
17:31:33.423 STDOUT terraform:   # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
17:31:33.423 STDOUT terraform:   ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
17:31:33.423 STDOUT terraform:         id              = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
17:31:33.424 STDOUT terraform:         tags            = {}
17:31:33.424 STDOUT terraform:       ~ thumbprint_list = [
17:31:33.424 STDOUT terraform:           ~ "9e99a48a9960b14926bb7f3b02e22da2b0ab7280" -> "06b25927c42a721631c1efd9431e648fa62e1e39",
17:31:33.424 STDOUT terraform:         ]
17:31:33.424 STDOUT terraform:         # (4 unchanged attributes hidden)
17:31:33.424 STDOUT terraform:     }
17:31:33.424 STDOUT terraform:   # aws_iam_role.admin will be updated in-place
17:31:33.424 STDOUT terraform:   ~ resource "aws_iam_role" "admin" {
17:31:33.424 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
17:31:33.424 STDOUT terraform:             {
17:31:33.424 STDOUT terraform:               - Statement = [
17:31:33.424 STDOUT terraform:                   - {
17:31:33.424 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
17:31:33.424 STDOUT terraform:                       - Condition = {
17:31:33.424 STDOUT terraform:                           - StringEquals = {
17:31:33.424 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
17:31:33.424 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
17:31:33.424 STDOUT terraform:                             }
17:31:33.424 STDOUT terraform:                         }
17:31:33.424 STDOUT terraform:                       - Effect    = "Allow"
17:31:33.424 STDOUT terraform:                       - Principal = {
17:31:33.424 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
17:31:33.425 STDOUT terraform:                         }
17:31:33.425 STDOUT terraform:                     },
17:31:33.425 STDOUT terraform:                 ]
17:31:33.425 STDOUT terraform:               - Version   = "2012-10-17"
17:31:33.425 STDOUT terraform:             }
17:31:33.425 STDOUT terraform:         ) -> (known after apply)
17:31:33.425 STDOUT terraform:         id                    = "admin-eks-role"
17:31:33.425 STDOUT terraform:         name                  = "admin-eks-role"
17:31:33.427 STDOUT terraform:         tags                  = {}
17:31:33.427 STDOUT terraform:         # (11 unchanged attributes hidden)
17:31:33.427 STDOUT terraform:     }
17:31:33.427 STDOUT terraform:   # aws_iam_role.api will be updated in-place
17:31:33.427 STDOUT terraform:   ~ resource "aws_iam_role" "api" {
17:31:33.427 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
17:31:33.428 STDOUT terraform:             {
17:31:33.428 STDOUT terraform:               - Statement = [
17:31:33.428 STDOUT terraform:                   - {
17:31:33.428 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
17:31:33.428 STDOUT terraform:                       - Condition = {
17:31:33.428 STDOUT terraform:                           - StringEquals = {
17:31:33.428 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
17:31:33.428 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
17:31:33.428 STDOUT terraform:                             }
17:31:33.428 STDOUT terraform:                         }
17:31:33.428 STDOUT terraform:                       - Effect    = "Allow"
17:31:33.428 STDOUT terraform:                       - Principal = {
17:31:33.428 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
17:31:33.428 STDOUT terraform:                         }
17:31:33.428 STDOUT terraform:                     },
17:31:33.428 STDOUT terraform:                 ]
17:31:33.428 STDOUT terraform:               - Version   = "2012-10-17"
17:31:33.428 STDOUT terraform:             }
17:31:33.428 STDOUT terraform:         ) -> (known after apply)
17:31:33.428 STDOUT terraform:         id                    = "api-eks-role"
17:31:33.428 STDOUT terraform:         name                  = "api-eks-role"
17:31:33.429 STDOUT terraform:         tags                  = {}
17:31:33.429 STDOUT terraform:         # (11 unchanged attributes hidden)
17:31:33.429 STDOUT terraform:     }
17:31:33.429 STDOUT terraform:   # aws_iam_role.celery will be updated in-place
17:31:33.429 STDOUT terraform:   ~ resource "aws_iam_role" "celery" {
17:31:33.429 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
17:31:33.429 STDOUT terraform:             {
17:31:33.429 STDOUT terraform:               - Statement = [
17:31:33.429 STDOUT terraform:                   - {
17:31:33.429 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
17:31:33.429 STDOUT terraform:                       - Condition = {
17:31:33.429 STDOUT terraform:                           - StringEquals = {
17:31:33.429 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
17:31:33.429 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-celery"
17:31:33.429 STDOUT terraform:                             }
17:31:33.429 STDOUT terraform:                         }
17:31:33.429 STDOUT terraform:                       - Effect    = "Allow"
17:31:33.429 STDOUT terraform:                       - Principal = {
17:31:33.429 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
17:31:33.429 STDOUT terraform:                         }
17:31:33.430 STDOUT terraform:                     },
17:31:33.430 STDOUT terraform:                 ]
17:31:33.430 STDOUT terraform:               - Version   = "2012-10-17"
17:31:33.430 STDOUT terraform:             }
17:31:33.430 STDOUT terraform:         ) -> (known after apply)
17:31:33.430 STDOUT terraform:         id                    = "celery-eks-role"
17:31:33.430 STDOUT terraform:         name                  = "celery-eks-role"
17:31:33.430 STDOUT terraform:         tags                  = {}
17:31:33.430 STDOUT terraform:         # (11 unchanged attributes hidden)
17:31:33.430 STDOUT terraform:     }
17:31:33.430 STDOUT terraform:   # aws_iam_role.database will be updated in-place
17:31:33.430 STDOUT terraform:   ~ resource "aws_iam_role" "database" {
17:31:33.430 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
17:31:33.430 STDOUT terraform:             {
17:31:33.430 STDOUT terraform:               - Statement = [
17:31:33.430 STDOUT terraform:                   - {
17:31:33.430 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
17:31:33.430 STDOUT terraform:                       - Condition = {
17:31:33.430 STDOUT terraform:                           - StringEquals = {
17:31:33.430 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
17:31:33.433 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-database"
17:31:33.433 STDOUT terraform:                             }
17:31:33.433 STDOUT terraform:                         }
17:31:33.434 STDOUT terraform:                       - Effect    = "Allow"
17:31:33.434 STDOUT terraform:                       - Principal = {
17:31:33.434 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
17:31:33.434 STDOUT terraform:                         }
17:31:33.434 STDOUT terraform:                     },
17:31:33.434 STDOUT terraform:                 ]
17:31:33.434 STDOUT terraform:               - Version   = "2012-10-17"
17:31:33.434 STDOUT terraform:             }
17:31:33.434 STDOUT terraform:         ) -> (known after apply)
17:31:33.434 STDOUT terraform:         id                    = "secrets-csi-role-database"
17:31:33.434 STDOUT terraform:         name                  = "secrets-csi-role-database"
17:31:33.434 STDOUT terraform:         tags                  = {}
17:31:33.434 STDOUT terraform:         # (11 unchanged attributes hidden)
17:31:33.434 STDOUT terraform:     }
17:31:33.434 STDOUT terraform:   # aws_iam_role.document_download will be updated in-place
17:31:33.434 STDOUT terraform:   ~ resource "aws_iam_role" "document_download" {
17:31:33.434 STDOUT terraform:       ~ assume_role_policy    =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
